<script setup lang="ts">
const localePath = useLocalePath();

useSeoMeta({
  title: "مشارکت",
  description: "همکاری در تکمیل آرشیو Old Persian Games",
});
</script>
<template>
  <UContainer>
    <UPage>
      <UPageHeader
        title="مشارکت"
        :ui="{
          wrapper: 'border-0 pb-0',
          container: 'lg:justify-center',
          title: 'text-2xl sm:text-2xl',
        }"
      >
        <template #headline>
          <UCard
            class="mb-4 min-w-0 flex-1"
            :ui="{
              body: {
                padding: 'px-3 py-3 sm:p-3',
              },
            }"
          >
            <UBreadcrumb
              :links="[
                {
                  label: $t('home'),
                  to: localePath('/'),
                  icon: 'i-heroicons-home',
                },
                {
                  label: $t('contribute'),
                  to: localePath('/contribute'),
                  icon: 'i-heroicons-hand-thumb-up',
                },
              ]"
            />
          </UCard>
        </template>
      </UPageHeader>

      <UPageBody prose>
        <p>
          هدف این وبسایت، جمع‌آوری و حفاظت از بازی‌های فارسی و جلوگیری از نابودی
          این آثار هست. عرضه‌ی اکثر این بازی‌ها در بازار سال‌هاست متوقف شده و
          ناشرین دست از کار کشیدن؛ و فایل‌های بیشتر این بازی‌ها، به سختی پیدا
          میشه. هدف ما این هست که با کمک هم‌دیگه این آثار رو جمع‌آوری کنیم و
          شرایطی رو ایجاد کنیم تا همه بتونن بصورت رایگان این آثار کم‌یاب رو
          دانلود و مورد استفاده قرار بدن.
        </p>
        <p>
          شاید شما هم توی انبار یا لابلای وسایل قدیمی، چیزی از بازی های فارسی
          قدیمی یا ملحقاتش رو داشته باشید. ازشون فایل کپی تهیه کنید و جهت آرشیو،
          نگهداری و انتشار، فایلش رو برامون ارسال کنید. اثری که ارسال می‌کنید،
          به نام خود شما در آرشیو ثبت میشه.
        </p>

        <UAlert
          icon="i-heroicons-exclamation-triangle"
          variant="subtle"
          title="توجه کنین!"
          color="orange"
        >
          <template #description>
            <p>
              شاید توی دیسک‌ها و فایل‌های قدیمی‌تون یه بازی دوبله رو پیدا کنید و
              اون بازی رو توی آرشیو ما دیده باشید و از ارسالش منصرف بشید به این
              خیال که اینجا هستش دیگه؛ ولی:
            </p>

            <p>
              - خیلی از بازی‌های قدیمی، بیشتر از یک‌بار دوبله شدن و حتی مواردی
              بوده که یک بازی، ۷ بار توسط ۷ شرکت مختلف، با گوینده‌های متفاوت
              دوبله و فروخته شده. ما همه‌ی نسخه‌ها و انتشارهای بازی‌ها رو آرشیو
              می‌کنیم. همین الان توی آرشیو ما، از بعضی بازی‌ها، ۵ دوبله‌ی متفاوت
              وجود داره و همچنان دنبال نسخه‌ها و دوبله‌های دیگر همون بازی هستیم.
            </p>

            <p>
              - بسیاری از کارهای شرکت‌های دهه‌ی هشتادی مفقود و گمشده هستن، و
              ممکنه اون نسخه‌ای که از اون اثر در اینجا وجود داره، با چیزی که دست
              شماست کاملاً متفاوت باشه.
            </p>

            <p>
              - غیر از بازی‌های فارسی، ما کتاب‌ها و مجلات، و آثار متفرقه و
              آموزشی فارسی که به بازی‌ها ربط داشته باشن رو هم آرشیو می‌کنیم.
            </p>
          </template>
        </UAlert>

        <p>
          ارسال اثر (در تلگرام):
          <a href="https://t.me/alihardan" dir="ltr">@alihardan</a>
        </p>

        <h2>نحوه تهیه کپی از بازی</h2>

        <p>
          اگر بازی که می‌خواید ارسال کنید بر روی دیسک (CD یا DVD) منتشر شده،
          حتماً باید از دیسک، فایلی به عنوان «ایمیج» تهیه کنید. «ایمیج»،
          تک‌فایلی هست که شامل کپی تمام دیسک در یک فایل هست. فرایند تهیه‌ی فایل
          ایمیج رو باید برای تک‌تک دیسک‌ها بصورت جداگانه انجام بدین.
        </p>

        <p>
          اگر اثری که در اختیار دارید بر دیسک عرضه نشده و یا دیسکش رو در اختیار
          ندارین، طبیعتاً امکان تهیه‌ی ایمیج وجود نداره. همون فایلی که در
          اختیارتون هست رو ارسال کنید.
        </p>

        <UAlert
          icon="i-heroicons-exclamation-triangle"
          variant="subtle"
          title="توجه کنین!"
          description="کپی کردن فایل‌های داخل دیسک بصورت دستی مورد تأیید نیست و حتماً باید از دیسک، بصورت مستقیم، ایمیج تهیه بشه."
          color="primary"
          class="not-prose"
        />

        <h3>تهیه‌ی ایمیج</h3>

        <p>
          نرم‌افزارهای مختلفی برای انجام این کار وجود داره. نرم‌افزار پیشنهادی
          ما در این آموزش، AnyBurn هست. با کلیک بر
          <a href="https://anyburn.com/anyburn_setup.exe">اینجا</a> آخرین نسخه‌ی
          این برنامه رو از سایت رسمی تهیه و سپس نصب کنید. این برنامه کاملاً
          رایگان هست.
        </p>

        <p>
          ۱. برنامه‌ی AnyBurn را اجرا کنید و بر &quot;Copy disc to image
          file&quot; کلیک کنید.
        </p>
        <p>
          <img
            src="https://www.anyburn.com/tutorials/images/copy-disc-to-bin-cue-file-1.png"
          />
        </p>
        <p>
          ۲. درایوی که دیسک در آن قرار گرفته را انتخاب کنید و مسیر ذخیره‌ی ایمیج
          را مشخص کنید. فرمت فایل ایمیج را انتخاب کنید (فرمت پیشنهادی: ISO). سپس
          بر &quot;Create Now&quot; کلیک کنید.
        </p>
        <p>
          <img
            src="https://www.anyburn.com/tutorials/images/copy-disc-to-iso-file-2.png"
          />
        </p>
        <p>۳. AnyBurn شروع به کپی دیسک در فایل ایمیج می‌کند.</p>
        <p>
          <img
            src="https://www.anyburn.com/tutorials/images/copy-disc-to-iso-file-3.png"
          />
        </p>

        <p>
          در صورت شکست عملیات، بررسی کنید علت چی بوده. از علت‌های شایع، خش‌دار
          بودن دیسک و یا قفل‌دار بودن دیسک هست. دیسک‌های قفل‌دار با روش‌های
          معمولی قابل کپی نیستن و باید از نرم‌افزارهای بخصوصی استفاده کرد.
        </p>

        <h2>تهیه‌ی تصویر از جلد، دیسک و دیگر ملحقات</h2>

        <p>
          اگر دستگاه اسکنر (Image scanner) در اختیار دارید، جلد (پشت و رو)،
          دیسک، تمام صفحات کتابچه‌ی راهنما، و سایر ملحقات بسته رو اسکن کنید. در
          صورتی که این دستگاه رو در اختیار ندارید، می‌تونید از دوربین‌ها (از
          جمله دوربین گوشی) استفاده کنید. برای اینکه تصویر کیفیتی مناسب داشته
          باشه، کاور رو بر یک کاغذ یا مقوای کاملاً سفید قرار بدید. در محیطی با
          نور مناسب، از زاویه‌ی مستقیم و با فاصله‌ی کم، اقدام به عکس‌برداری
          کنید. تجربه نشون داده عکس‌برداری در سایه‌ی روز، نتیجه‌ی مناسب‌تری نسبت
          به استفاده از نور چراغ داره.
        </p>

        <h2>کپی‌ها رو گرفتم. حالا چطوری ارسال کنم؟</h2>

        <p>
          فایل‌های تهیه شده رو می‌تونید در هر فضایی آپلود کنید و به ما دسترسی به
          فایل رو بدید (لینک رو برامون ارسال کنید). تلگرام، گوگل درایو و
          mega.nz، فضاهای مناسبی برای آپلود فایل‌ها هستن. ما فایل آپلودی شما رو
          به فضاهایی که برای آرشیو در نظر گرفتیم منتقل خواهیم کرد.
        </p>
        <p>
          ارسال اثر (در تلگرام):
          <a href="https://t.me/alihardan" dir="ltr">@alihardan</a>
        </p>
      </UPageBody>
    </UPage>
  </UContainer>
</template>
